In [1]:
import pandas as pd

In [7]:
df = pd.read_csv("Data/world_cities.csv", index_col=0)

In [8]:
#1번 문제 총 몇개의 나라와 도시가 있는지 구해보세요.
df

    City / Urban area     Country  Population  Land area (in sqKm)
0        Buenos Aires   Argentina    11200000                 2266
1           Melbourne   Australia     3162000                 2080
2              Sydney   Australia     3502000                 1687
3            Brisbane   Australia     1508000                 1603
4               Perth   Australia     1177000                  964
..                ...         ...         ...                  ...
245            Canton         USA      267000                  372
246           Spokane         USA      335000                  371
247          Tashkent  Uzbekistan     2200000                  531
248  Ho Chi Minh City     Vietnam     4900000                  518
249            Harare    Zimbabwe     1750000                  712

[249 rows x 4 columns]

In [9]:
df.shape

(249, 4)

In [12]:
df.describe()

         Population  Land area (in sqKm)
count  2.490000e+02           249.000000
mean   3.006538e+06          1035.212851
std    4.136435e+06          1033.487331
min    1.810000e+05           365.000000
25%    5.980000e+05           511.000000
50%    1.500000e+06           684.000000
75%    3.502000e+06          1116.000000
max    3.320000e+07          8683.000000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 249 entries, 0 to 249
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   City / Urban area    249 non-null    object
 1   Country              249 non-null    object
 2   Population           249 non-null    int64
 3   Land area (in sqKm)  249 non-null    int64
dtypes: int64(2), object(2)
memory usage: 9.7+ KB

In [27]:
df["City / Urban area"].unique()

array(['Buenos Aires', 'Melbourne', 'Sydney', 'Brisbane', 'Perth',
       'Adelaide', 'Gold Coast', 'Vienna', 'Baku/Sumqayit', 'Brussels',
       'Antwerp', 'Sao Paulo', 'Rio de Janeiro', 'Belo Horizonte',
       'Curitiba', 'Brasilia', 'Fortaleza', 'Porto Alegre', 'Campinas',
       'Goiania', 'Recife', 'Phnom Penh', 'Montreal.', 'Toronto',
       'Vancouver', 'Edmonton', 'Calgary', 'Quebec', 'Ottawa/Hull',
       'Winnipeg', 'St. Catharines', 'Santiago', 'Beijing', 'Shanghai',
       'Shenzhen', 'Shenyang', 'Tianjin', 'Dalian', 'Bogota', 'Kinshasa',
       'Lumumbashi', 'Copenhagen', 'Quito', 'Cairo', 'Helsinki', 'Paris',
       'Marseille', 'Bordeaux', 'Lyon', 'Toulouse', 'Nice', 'Toulon',
       'Avignon', 'Valenciennes', 'Douai/Lens', 'Nantes', 'Lille', 'Pau',
       'Tours', 'Bethune', 'Essen/Düsseldorf', 'Berlin', 'Frankfurt',
       'Hamburg', 'Cologne/Bonn', 'Munich', 'Stuttgart', 'Aachen',
       'Accra', 'Athens', 'Budapest', 'Delhi', 'Hyderabad', 'Bangalore',
       'Kolkata', 'Mumbai', 'Chennai', 'Jakarta', 'Tehran', 'Baghdad',
       'Dublin', 'Tel Aviv', 'Milan', 'Rome', 'Naples', 'Turin',
       'Tokyo/Yokohama', 'Nagoya', 'Osaka/Kobe/Kyoto', 'Fukuoka',
       'Sapporo', 'Kuwait', 'Beirut', 'Kuala Lumpur', 'Mexico City',
       'Guadalajara', 'Monterey', 'Rotterdam', 'Auckland', 'Lagos',
       'Lahore', 'Karachi', 'Lima', 'Manila', 'Katowice', 'Warsaw',
       'Lisbon', 'Porto', 'San Juan', 'Aguadilla', 'Moscow',
       'St Petersburg', 'Nizhni Novgorod', 'Arabia', 'Riyadh', 'Jeddah',
       'Singapore', 'Johannesburg/East Rand', 'Durban', 'Cape Town',
       'Pretoria', 'Vereeniging', 'Port Elizabeth', 'Seoul/Incheon',
       'Madrid', 'Barcelona', 'Khartoum', 'Stockholm', 'Taichung',
       'Taipei', 'Bangkok', 'Istanbul', 'Ankara', 'Abu Dhabi', 'Dubai',
       'London', 'Birmingham', 'Manchester', 'Leeds/Bradford', 'Glasgow',
       'Donetsk', 'New York Metro', 'Chicago', 'Atlanta', 'Philadelphia',
       'Boston', 'Los Angeles', 'Dallas/Fort Worth', 'Houston', 'Detroit',
       'Washington', 'Miami', 'Seattle', 'Minneapolis/St. Paul',
       'Pittsburgh', 'St. Louis', 'Tampa//St. Petersburg', 'Phoenix/Mesa',
       'San Diego', 'Baltimore', 'Cincinnati', 'Cleveland', 'Kansas City',
       'Indianapolis', 'San Francisco//Oakland', 'Virginia Beach',
       'Providence', 'Denver', 'Milwaukee', 'Portland', 'Hartford',
       'Bridgeport//Stamford', 'Orlando', 'Riverside/San Bernardino',
       'Richmond', 'Charlotte', 'Nashville', 'Jacksonville',
       'San Antonio', 'Memphis', 'Columbus', 'Louisville', 'Sacramento',
       'Buffalo', 'Knoxville', 'Dayton', 'Oklahoma City', 'Raleigh',
       'Austin', 'McAllen', 'Springfield', 'Akron', 'Rochester', 'Tucson',
       'Chattanooga', 'Allentown/Bethlehem', 'Barnstable Town',
       'Las Vegas', 'New Haven', 'Albany', 'Baton Rouge',
       'Sarasota//Bradenton', 'Columbia', 'Poughkeepsie', 'Tulsa',
       'San Jose', 'Grand Rapids', 'Winston/Salem', 'Worcester',
       'Augusta', 'Flint', 'Charleston', 'Salt Lake City', 'Youngstown',
       'Greenville', 'Omaha', 'Albuquerque', 'Palm Bay', 'El Paso',
       'Pensacola', 'Hickory', 'Mobile', 'Harrisburg', 'Asheville',
       'Little Rock', 'Toledo', 'Lancaster', 'New Orleans',
       'Colorado Springs', 'Cape Coral', 'Ogden', 'Syracuse', 'Wichita',
       'Concord', 'Port St Lucie', 'Fayetteville', 'Jackson', 'Scranton',
       'Huntsville', 'Durham', 'South Bend', 'Shreveport', 'Honolulu',
       'Bonita Springs / Naples', 'Canton', 'Spokane', 'Tashkent',
       'Ho Chi Minh City', 'Harare'], dtype=object)

In [30]:
df["City / Urban area"].value_counts()

Baku/Sumqayit     1
Berlin            1
Albuquerque       1
Portland          1
Shenzhen          1
                 ..
Fortaleza         1
Hamburg           1
Little Rock       1
Belo Horizonte    1
Salt Lake City    1
Name: City / Urban area, Length: 249, dtype: int64

In [24]:
df["Country"]

0       Argentina
1       Australia
2       Australia
3       Australia
4       Australia
          ...
245           USA
246           USA
247    Uzbekistan
248       Vietnam
249      Zimbabwe
Name: Country, Length: 249, dtype: object

In [25]:
df["Country"].unique()

array(['Argentina', 'Australia', 'Austria', 'Azerbaijan', 'Belgium',
       'Brazil', 'Cambodia', 'Canada', 'Chile', 'China', 'Colombia',
       'Congo', 'Denmark', 'Ecuador', 'Egypt', 'Finland', 'France',
       'Germany', 'Ghana', 'Greece', 'Hungary', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy', 'Japan', 'Kuwait',
       'Lebanon', 'Malaysia', 'Mexico', 'Netherlands', 'New Zealand',
       'Nigeria', 'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal',
       'Puerto Rico', 'Russia', 'Saudi', 'Saudi Arabia', 'Singapore',
       'South Africa', 'South Korea', 'Spain', 'Sudan', 'Sweden',
       'Taiwan', 'Thailand', 'Turkey', 'UAE', 'UK', 'Ukraine', 'USA',
       'Uzbekistan', 'Vietnam', 'Zimbabwe'], dtype=object)

In [26]:
df["Country"].value_counts()

USA           105
France         15
Brazil         10
Canada          9
Germany         8
             ...
Hungary         1
Azerbaijan      1
Kuwait          1
Colombia        1
Denmark         1
Name: Country, Length: 61, dtype: int64

In [ ]:
#2번 인구수/면적 >10000이 넘는 도시가 몇개인지 구하시오

In [31]:
df

    City / Urban area     Country  Population  Land area (in sqKm)
0        Buenos Aires   Argentina    11200000                 2266
1           Melbourne   Australia     3162000                 2080
2              Sydney   Australia     3502000                 1687
3            Brisbane   Australia     1508000                 1603
4               Perth   Australia     1177000                  964
..                ...         ...         ...                  ...
245            Canton         USA      267000                  372
246           Spokane         USA      335000                  371
247          Tashkent  Uzbekistan     2200000                  531
248  Ho Chi Minh City     Vietnam     4900000                  518
249            Harare    Zimbabwe     1750000                  712

[249 rows x 4 columns]

In [34]:
df["Population"]/df["Land area (in sqKm)"]

0      4942.630185
1      1520.192308
2      2075.874333
3       940.736120
4      1220.954357
          ...
245     717.741935
246     902.964960
247    4143.126177
248    9459.459459
249    2457.865169
Length: 249, dtype: float64

In [35]:
df["Population"]/df["Land area (in sqKm)"]>10000

0      False
1      False
2      False
3      False
4      False
       ...
245    False
246    False
247    False
248    False
249    False
Length: 249, dtype: bool

In [39]:
adf = df["Population"]/df["Land area (in sqKm)"]

In [40]:
adf

0      4942.630185
1      1520.192308
2      2075.874333
3       940.736120
4      1220.954357
          ...
245     717.741935
246     902.964960
247    4143.126177
248    9459.459459
249    2457.865169
Length: 249, dtype: float64

In [43]:
adf.sort_values(ascending=False)

75     29648.760331
74     23917.137476
101    18918.918919
99     18157.181572
34     17167.381974
           ...
195      458.055925
224      414.179104
57       402.222222
221      344.322344
197      329.284750
Length: 249, dtype: float64

In [45]:
adf.shape

(249,)

In [76]:
hdf = pd.DataFrame(adf)

In [62]:
hdf

               0
0    4942.630185
1    1520.192308
2    2075.874333
3     940.736120
4    1220.954357
..           ...
245   717.741935
246   902.964960
247  4143.126177
248  9459.459459
249  2457.865169

[249 rows x 1 columns]

In [68]:
df["a"] = adf>10000

In [69]:
df

    City / Urban area     Country  Population  Land area (in sqKm)      a
0        Buenos Aires   Argentina    11200000                 2266  False
1           Melbourne   Australia     3162000                 2080  False
2              Sydney   Australia     3502000                 1687  False
3            Brisbane   Australia     1508000                 1603  False
4               Perth   Australia     1177000                  964  False
..                ...         ...         ...                  ...    ...
245            Canton         USA      267000                  372  False
246           Spokane         USA      335000                  371  False
247          Tashkent  Uzbekistan     2200000                  531  False
248  Ho Chi Minh City     Vietnam     4900000                  518  False
249            Harare    Zimbabwe     1750000                  712  False

[249 rows x 5 columns]

In [74]:
df["a"].value_counts()

False    230
True      19
Name: a, dtype: int64

In [82]:
(adf>10000).value_counts()

False    230
True      19
dtype: int64

In [83]:
#해설

In [84]:
df["Density"] = df["Population"] / df["Land area (in sqKm)"]
df

,City / Urban area,Country,Population,Land area (in sqKm),a,Density
0,Buenos Aires,Argentina,11200000,2266,False,4942.630185
1,Melbourne,Australia,3162000,2080,False,1520.192308
2,Sydney,Australia,3502000,1687,False,2075.874333
3,Brisbane,Australia,1508000,1603,False,940.736120
4,Perth,Australia,1177000,964,False,1220.954357
...,...,...,...,...,...,...
245,Canton,USA,267000,372,False,717.741935
246,Spokane,USA,335000,371,False,902.964960
247,Tashkent,Uzbekistan,2200000,531,False,4143.126177
248,Ho Chi Minh City,Vietnam,4900000,518,False,9459.459459
249,Harare,Zimbabwe,1750000,712,False,2457.865169

In [86]:
df_high_density = df[df["Density"] > 10000] #이거구나
df_high_density

,City / Urban area,Country,Population,Land area (in sqKm),a,Density
32,Beijing,China,8614000,748,True,11516.042781
33,Shanghai,China,10000000,746,True,13404.825737
34,Shenzhen,China,8000000,466,True,17167.381974
36,Tianjin,China,4750000,453,True,10485.651214
38,Bogota,Colombia,7000000,518,True,13513.513514
39,Kinshasa,Congo,5000000,469,True,10660.980810
71,Delhi,India,14300000,1295,True,11042.471042
73,Bangalore,India,5400000,534,True,10112.359551
74,Kolkata,India,12700000,531,True,23917.137476
75,Mumbai,India,14350000,484,True,29648.760331
76,Chennai,India,5950000,414,True,14371.980676
77,Jakarta,Indonesia,14250000,1360,True,10477.941176
78,Tehran,Iran,7250000,686,True,10568.513120
99,Lagos,Nigeria,13400000,738,True,18157.181572
101,Karachi,Pakistan,9800000,518,True,18918.918919
102,Lima,Peru,7000000,596,True,11744.966443
103,Manila,Philippines,14750000,1399,True,10543.245175
123,Seoul/Incheon,South Korea,17500000,1049,True,16682.554814
129,Taipei,Taiwan,5700000,376,True,15159.574468

In [90]:
df["Density"] > 10000

0      False
1      False
2      False
3      False
4      False
       ...
245    False
246    False
247    False
248    False
249    False
Name: Density, Length: 249, dtype: bool

In [91]:
df[df["Density"] > 10000]

,City / Urban area,Country,Population,Land area (in sqKm),a,Density
32,Beijing,China,8614000,748,True,11516.042781
33,Shanghai,China,10000000,746,True,13404.825737
34,Shenzhen,China,8000000,466,True,17167.381974
36,Tianjin,China,4750000,453,True,10485.651214
38,Bogota,Colombia,7000000,518,True,13513.513514
39,Kinshasa,Congo,5000000,469,True,10660.980810
71,Delhi,India,14300000,1295,True,11042.471042
73,Bangalore,India,5400000,534,True,10112.359551
74,Kolkata,India,12700000,531,True,23917.137476
75,Mumbai,India,14350000,484,True,29648.760331
76,Chennai,India,5950000,414,True,14371.980676
77,Jakarta,Indonesia,14250000,1360,True,10477.941176
78,Tehran,Iran,7250000,686,True,10568.513120
99,Lagos,Nigeria,13400000,738,True,18157.181572
101,Karachi,Pakistan,9800000,518,True,18918.918919
102,Lima,Peru,7000000,596,True,11744.966443
103,Manila,Philippines,14750000,1399,True,10543.245175
123,Seoul/Incheon,South Korea,17500000,1049,True,16682.554814
129,Taipei,Taiwan,5700000,376,True,15159.574468

In [89]:
df_high_density.info() #5번 19개

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19 entries, 32 to 129
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   City / Urban area    19 non-null     object
 1   Country              19 non-null     object
 2   Population           19 non-null     int64
 3   Land area (in sqKm)  19 non-null     int64
 4   a                    19 non-null     bool
 5   Density              19 non-null     float64
dtypes: bool(1), float64(1), int64(2), object(2)
memory usage: 931.0+ bytes

In [93]:
df.sort_values(by='Density', ascending=False) #3번 가장 인구밀도가 높은 도시는? 뭄바이

,City / Urban area,Country,Population,Land area (in sqKm),a,Density
75,Mumbai,India,14350000,484,True,29648.760331
74,Kolkata,India,12700000,531,True,23917.137476
101,Karachi,Pakistan,9800000,518,True,18918.918919
99,Lagos,Nigeria,13400000,738,True,18157.181572
34,Shenzhen,China,8000000,466,True,17167.381974
...,...,...,...,...,...,...
195,Chattanooga,USA,344000,751,False,458.055925
224,Asheville,USA,222000,536,False,414.179104
57,Pau,France,181000,450,False,402.222222
221,Hickory,USA,188000,546,False,344.322344
197,Barnstable Town,USA,244000,741,False,329.284750

In [100]:
df['Country'].unique()

array(['Argentina', 'Australia', 'Austria', 'Azerbaijan', 'Belgium',
       'Brazil', 'Cambodia', 'Canada', 'Chile', 'China', 'Colombia',
       'Congo', 'Denmark', 'Ecuador', 'Egypt', 'Finland', 'France',
       'Germany', 'Ghana', 'Greece', 'Hungary', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy', 'Japan', 'Kuwait',
       'Lebanon', 'Malaysia', 'Mexico', 'Netherlands', 'New Zealand',
       'Nigeria', 'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal',
       'Puerto Rico', 'Russia', 'Saudi', 'Saudi Arabia', 'Singapore',
       'South Africa', 'South Korea', 'Spain', 'Sudan', 'Sweden',
       'Taiwan', 'Thailand', 'Turkey', 'UAE', 'UK', 'Ukraine', 'USA',
       'Uzbekistan', 'Vietnam', 'Zimbabwe'], dtype=object)

In [108]:
df["Country"].value_counts()

USA           105
France         15
Brazil         10
Canada          9
Germany         8
             ...
Hungary         1
Azerbaijan      1
Kuwait          1
Colombia        1
Denmark         1
Name: Country, Length: 61, dtype: int64

In [106]:
df["Country"].value_counts() == 4

USA           False
France        False
Brazil        False
Canada        False
Germany       False
              ...
Hungary       False
Azerbaijan    False
Kuwait        False
Colombia      False
Denmark       False
Name: Country, Length: 61, dtype: bool

In [112]:
sdf = df["Country"].value_counts() == 4

In [113]:
sdf

USA           False
France        False
Brazil        False
Canada        False
Germany       False
              ...
Hungary       False
Azerbaijan    False
Kuwait        False
Colombia      False
Denmark       False
Name: Country, Length: 61, dtype: bool

In [115]:
df["b"] = sdf
df

,City / Urban area,Country,Population,Land area (in sqKm),a,Density,b
0,Buenos Aires,Argentina,11200000,2266,False,4942.630185,NaN
1,Melbourne,Australia,3162000,2080,False,1520.192308,NaN
2,Sydney,Australia,3502000,1687,False,2075.874333,NaN
3,Brisbane,Australia,1508000,1603,False,940.736120,NaN
4,Perth,Australia,1177000,964,False,1220.954357,NaN
...,...,...,...,...,...,...,...
245,Canton,USA,267000,372,False,717.741935,NaN
246,Spokane,USA,335000,371,False,902.964960,NaN
247,Tashkent,Uzbekistan,2200000,531,False,4143.126177,NaN
248,Ho Chi Minh City,Vietnam,4900000,518,False,9459.459459,NaN
249,Harare,Zimbabwe,1750000,712,False,2457.865169,NaN

In [116]:
sdf.value_counts()

False    60
True      1
Name: Country, dtype: int64

In [120]:
df["Country"].value_counts()

USA           105
France         15
Brazil         10
Canada          9
Germany         8
             ...
Hungary         1
Azerbaijan      1
Kuwait          1
Colombia        1
Denmark         1
Name: Country, Length: 61, dtype: int64

In [125]:
country = df["Country"].value_counts()

In [126]:
country

USA           105
France         15
Brazil         10
Canada          9
Germany         8
             ...
Hungary         1
Azerbaijan      1
Kuwait          1
Colombia        1
Denmark         1
Name: Country, Length: 61, dtype: int64

In [128]:
country[country == 4]

Italy    4
Name: Country, dtype: int64

In [129]:
df["Country"].value_counts()[df["Country"].value_counts() == 4] #너무 어렵군

Italy    4
Name: Country, dtype: int64